Repository: translate5/translate5
Catalog: application/modules/editor/testcases/editorAPI/Translate3117Test/resource1.tmx
Source language: de_de
Languages: en_uk, en_us

source: Consulting, Unterstützung, Updates - MittagQI - Quality Informatics
en_uk: Consulting, Support, Updates - MittagQI - Quality Informatics

source: Suchen MittagQI - Quality Informatics
en_uk: Search MittagQI - Quality Informatics

source: Consulting zu CAT-Systemen !
en_uk: Consulting for CAT-systems !

source: Über MittagQI
en_uk: About MittagQI

source: Über Marc Mittag
en_uk: About Marc Mittag
en_us: About Marc Mittag

source: Entwicklung
en_uk: Development

source: Unser Produktportfolio
en_uk: Our Product Portfolio

source: Automatisiertes Testing
en_uk: Automated Testing

source: Impressum
en_uk: About this Website

source: Script-Entwicklung
en_uk: Script Development

source: Automatisierung
en_uk: Automation

source: Open Source Translation-Serverlösung
en_uk: Open Source Translation Server Solution

source: Überblick
en_uk: Overview

source: Herausragende Features
en_uk: Prominent Features

source: Zehntausende Segmente
en_uk: Tens of Thousands of Segments

source: QM-Erfassung auf Subsegment-Basis
en_uk: QM Acquisition on Subsegment Basis

source: Desktop im Browser
en_uk: Desktop in Browser

source: Änderungen in Trados verfolgen
en_uk: Tracking Changes in Trados

source: zur Performance
en_uk: for Performance

source: zur Vorgehensweise beim Lektorat
en_uk: for Approach When Editing

source: zur Qualitätssicherung
en_uk: for Quality Assurance

source: zur Usability der Ansicht
en_uk: for Usability of the View

source: zur Effizienz des Lektorats
en_uk: for Efficiency of Editing

source: Customizing & Weiterentwicklung
en_uk: Customizing & Further Development

source: Weiterentwicklung
en_uk: Further Development

source: Consulting, Unterstützung, Updates
en_uk: Consulting, Support, Updates

source: Softwarewartung & Updates
en_uk: Software Maintenance & Updates

source: Unterstützung
en_uk: Support

source: Suchwort tippen und Return drücken
en_uk: Enter search term and press return

source: translate5 Consulting, Unterstützung, Updates
en_uk: translate5 Consulting, Support, Updates

source: Kontaktieren Sie uns!
en_uk: Contact us!

source: Sie möchten translate5 nutzen, aber nicht bei sich installieren?
en_uk: You would like to use translate5, but not install it?

source: Nutzen Sie unsere Hosting-Angebote!
en_uk: Use our hosting offers!

source: Sie möchten translate5 einsetzen und benötigen Unterstützung bei der Systeminstallation oder Benutzung?
en_uk: You would like to deploy translate5 and need support with the installation of the system or its usage?

source: Fragen Sie andere translate5-Nutzer - wir sind bekannt für unsere schnellen Reaktionszeiten!
en_uk: Ask other translate5 users - we are known for our fast response times!

source: Wir bieten Ihnen Softwarewartung und Updates.
en_uk: We offer you software maintenance and updates.

source: < Zurück
en_uk: < Back

source: Weiter >
en_uk: Continue >

source: Copyright © 2012 MittagQI - Quality Informatics | Zum Impressum
en_uk: Copyright © 2012 MittagQI - Quality Informatics | To About the Website

source: Zum Impressum
en_uk: To About the Website

source: Sie möchten regelmäßig und automatisch Ihre translate5-Installation up2date halten?
en_uk: You would like to regularly and automatically keep your translate5 installation up-to-date?

source: Customizing & Weiterentwicklung - MittagQI - Quality Informatics
en_uk: Customizing & Further Development - MittagQI - Quality Informatics

source: Optimale Verwendung
en_uk: Optimum Use

source: Nutzen einer Relaissprache
en_uk: Use of a Relay Language

source: translate5 Customizing & Weiterentwicklung
en_uk: translate5 Customizing & Further Development

source: Weiterentwicklung & Customizing von translate5
en_uk: Further Development & Customizing of translate5

source: Wir passen translate5 an Ihre Bedürfnisse an.
en_uk: We customize translate5 to your needs.

source: Sie benötigen ein Feature, welches es aktuell noch nicht in translate5 gibt?
en_uk: You need a feature not yet currently available in translate5?

source: Sie möchten translate5 in Ihre Produktionsumgebung integrieren, wie dies z. B. bei beo in der beoSphere oder bei itl in [i]-gate bereits der Fall ist? translate5 ist dafür vorbereitet - sprechen Sie uns an!
en_uk: You would like to integrate translate5 into your production environment, as it is already the case with beo in the beoSphere or with itl in [i]-gate? translate5 is ready for that - contact us!

source: translate5 ist Open Source:
en_uk: translate5 is Open Source:

source: translate5 steht unter http://github.com/mittagqi zum Download als Quellcode zur Verfügung.
en_uk: translate5 is available at http://github.com/mittagqi to download as source code

source: Auf dieser Basis können Sie sich an der Weiterentwicklung von translate5 beteiligen.
en_uk: This way, you can participate in further development of translate5.

source: Bitte sprechen Sie uns bei Interesse an, um die gemeinsame Entwicklung via github zu koordinieren und zu organisieren!
en_uk: If you are interested, please feel free to contact us to coordinate and organize the joint development via github!

source: translate5 gefällt Ihnen gut, sie möchten es gern einsetzen, aber an der einen oder anderen Stelle sollte für Ihre Bedürfnisse etwas anders sein?
en_uk: You like translate5 very much, you would like to use it, but here and there something should be different for your needs?

source: Entwicklung - MittagQI - Quality Informatics
en_uk: Development - MittagQI - Quality Informatics

source: Unsere Softwareentwicklung verbindet langjährige Erfahrung in Webentwicklung und prozessbegleitender Entwicklung der Übersetzungsbranche mit modernster objektorientierter, aber noch pragmatischer Softwarearchitektur.
en_uk: Our software development combines many years of experience in web development and process-accompanying development of the translation industry with the latest, object-oriented, yet still pragmatic software architecture.
en_us: Our software development combines many years of experience in web development and process-accompanying development of the translation industry with the latest, object-oriented, yet still pragmatic software architecture.

source: Gleichzeitig legen wir großen Wert auf eine ausführliche Quellcodedokumentation.
en_uk: At the same time, we attach great importance to extensive source code documentation.
en_us: At the same time, we attach great importance to extensive source code documentation.

source: Die Hersteller propertiärer Software binden Sie dadurch, dass niemand anders ihren Quellcode lesen und weiterentwickeln kann oder sogar darf.
en_uk: Manufacturers of proprietary software commit you in such a way that nobody else can or even may read or further develop their source code.
en_us: Manufacturers of proprietary software bind you in such a way that nobody else can or even may read or further develop their source code.

source: Unser Wunsch ist es, dass Sie mit uns arbeiten, da dies für Sie die beste Lösung ist !
en_uk: It is our hope that you work with us, because this is the best solution for you !
en_us: It is our hope that you work with us, because this is the best solution for you !

source: Unser Produktportfolio:
en_uk: Our Product Portfolio:

source: Übersetzungsportale, E-Commerce-Shop-Lösungen und translate5
en_uk: Translation Portals, E-Commerce Shop Solutions, and translate5

source: Softwareentwicklung
en_uk: Software Development

source: Der Schwerpunkt unserer Softwareentwicklung liegt im Bereich der Übersetzungsbranche und bei E-Commerce-Shop-Lösungen.
en_uk: Our software development is focusing on the translation industry and e-commerce-shop solutions.
en_us: Our software development is focusing on the translation industry and e-commerce-shop solutions.

source: Übersetzungsportale
en_uk: Translation Portals

source: Sie möchten Ihre Übersetzungsprozesse mit oder ohne Across und SDL Trados möglichst vollständig automatisieren?
en_uk: You would like to automate your translation processes with or without Across and SDL Trados as completely as possible?
en_us: You would like to automate your translation processes with or without Across and SDL Trados as completely as possible?

source: Sie möchten Ihren Kunden ein einfach zu bedienendes Interface für alle ihre Bedürfnisse bieten?
en_uk: You would like to offer your clients an easy to handle interface for all needs?
en_us: You would like to offer your clients an easy to handle interface for all needs?

source: E-Commerce-Shop-Lösungen
en_uk: E-Commerce Shop Solutions
en_us: E-Commerce Shop Solutions

source: Wir betreuen und entwickeln seit vielen Jahren E-Commerce-Shoplösungen auf Basis von Magento und OsCommerce.
en_uk: For many years, we have been serving and developing e-commerce shop solutions based on Magento and OsCommerce.

source: Gerne betreuen wir auch Ihren Shop und passen ihn Ihren individuellen Bedürfnissen an!
en_uk: We will be happy to serve your shop, as well, and tailor it to your individual needs!
en_us: We will be happy to serve your shop, as well, and tailor it to your individual needs!

source: Bitte achten Sie hier auf die Technik.
en_uk: Please note the technology here.

source: Sat Nam Versand - Yoga, Musik, Yoga-Kleidung und mehr
en_uk: Sat Nam Versand - yoga, music, yoga attire, and more

source: Download Kundalini Yoga Mantra Musik!
en_uk: Download Kundalini Yoga Mantra music!

source: Noch dazu ist translate5 als Open Source für Sie verfügbar!
en_uk: In addition, translate5 is available to you as an open source!
en_us: In addition, translate5 is available to you as Open Source!

source: Sehen Sie selbst:
en_uk: See for yourself:

source: Überblick translate5
en_uk: Overview translate5
en_us: Overview translate5

source: Sie interessiert Einsatz, Installation und Bedienung von translate5?
en_uk: You are interested inusage, installation, and operation of translate5?
en_us: You are interested in usage, installation, and operation of translate5?

source: Hier erfahren Sie mehr!
en_uk: Find out more here!
en_us: Find out more here!

source: Wir arbeiten mit am Markt weit verbreiteten Softwarebibliotheken, Systemen und Programmiersprachen, die gleichzeitig jeweils zu den besten ihrer Art gehören.
en_uk: We are working with software libraries, systems, and programming languages widespread on the market, which each are one of the best of their kind.
en_us: We are working with software libraries, systems, and programming languages widespread on the market, which each are one of the best of their kind.

source: Unsere Kompetenzen im Überblick
en_uk: Overview of Our Competencies
en_us: Overview of Our Competencies

source: OsCommerce (nicht modern, aber noch weit verbereitet und von uns mit langjähriger Erfahrung unterstützt)
en_uk: OsCommerce (not state-of-the-art, but still widespread and supported by us with many years of experience)
en_us: OsCommerce (not state-of-the-art, but still widespread and supported by us with many years of experience)

source: Automatisiertes Testing mit phpUnit und Selenium
en_uk: Automated Testing with phpUnit and Selenium

source: Im Detail bietet automatisiertes Testing die folgenden Vorteile:
en_uk: In detail, automated testing offers the following advantages:
en_us: In detail, automated testing offers the following advantages:

source: Bei Softwareupdates (z. B. eines der Frameworks) kann ohne Probleme getestet werden, ob die Gesamtapplikation noch funktioniert.
en_uk: When updating software (e.g. one of the frameworks), tests can check without any problems, if the overall application is still working.

source: Bei Einbeziehung dritter Entwickler kann der betreffende Entwickler sehr einfach testen, ob nach seinen Ergänzungen die Gesamtheit der Anwendung noch funktioniert.
en_uk: When including third-party developers, the respective developer is able to test very easily, if the entire application is still working after his additions.

source: Er ist dafür nicht auf Detailkenntnisse der Anwendung in Bereichen angwiesen, die ihn nicht betreffen.
en_uk: For that, he does not depend on detailed knowledge of the application in areas, which are not of his concern.

source: Auf Dauer kann so eine höhere Codequalität und Zuverlässigkeit der Software gewährleistet werden.
en_uk: In the long run, higher code quality and reliability of the software can be assured this way.

source: Zu Selenium
en_uk: In Regard to Selenium

source: Selenium ist ein in Javascript geschriebenes Testframework für oberflächenbasierte Tests im Browser.
en_uk: Selenium is a test framework written in Javascript for surface-based tests in the browser.

source: Für phpUnit und Zend Framework existieren jeweils spezifische Seleniumintegrationen.
en_uk: Specific Selenium integrations, respectively, exist for phpUnit and Zend Framework.

source: So kann die Funktionalität der Software in kurzer Zeit getestet werden, ohne dass dies ein Anwender manuell durchführen muss.
en_uk: This way, the software's functionality can be tested without a user having to do this manually.

source: Features von translate5
en_uk: Features of translate5

source: Featureübersicht
en_uk: Feature Overview

source: Vorgehensweise beim Lektorat
en_uk: Approach When Editing

source: Qualitätssicherung
en_uk: Quality Assurance

source: Hunderte Dateien verwalten
en_uk: Managing Hundreds of Files

source: Ansicht
en_uk: Display

source: Effizientes Lektorat
en_uk: Efficient Editing

source: Kurztag- Modus, Volltag-Modus und Ausblendung von Tags
en_uk: Short tag mode, full tag mode, and fade-out of tags

source: Die Performance von translate5 ist unabhängig von der Größe des Projekts.
en_uk: The performance of translate5 is independent from the size of the project.

source: Dies ermöglicht die moderne Architektur:
en_uk: This is possible due to state-of-the-art architecture:

source: Alle Segmente eines Projektes sind in einer fortlaufend scrollbaren Tabelle bearbeitbar.
en_uk: All segments of a project can be processed in a table that can be continuously scrolled.

source: Öffnen und schließen einzelner Dateien entfällt.
en_uk: Opening and closing individual files is no longer required.

source: 500 kleine Dateien lassen sich somit vom Lektor genauso effizient bearbeiten wie 3 große.
en_uk: Consequently, 500 small files can be processed by the editor just as efficiently as 3 large ones.

source: Hunderte Dateien in einem Projekt
en_uk: Hundreds of Files in a Project

source: Dieser kann beliebig tief verschachtelt sein und eine beliebige Anzahl von Dateien enthalten.
en_uk: This can be nested arbitrarily deep and contain any number of files.

source: Die Ordnerhierarchien spiegeln die Ordnerstruktur im Importverzeichnis wieder.
en_uk: Folder hierarchies reflect the folder structure in the import list.

source: Ausgangssprache, Zielsprache, lektorierte Zielsprache, Relaissprache, Kommentare und alle Metadaten sind in translate5 in jeweils eigenen Spalten geführt.
en_uk: Source language, target language, edited target language, relay language, comments, and all meta data are listed in their own columns in translate5.

source: Jede dieser Spalten ist filter- und sortierbar und lässt sich ein- und ausblenden.
en_uk: Each of these columns can be filtered and sorted and can be faded in and out.

source: Filterung
en_uk: Filtering

source: Die Filter lassen sich mit UND-Verknüpfung miteinander kombinieren.
en_uk: The filters can be combined with each other by AND operation.

source: So lassen sich z. B. mit wenigen Klicks alle Segmente selektieren und anschließend lektorieren, die als "Muss überarbeitet werden" gekennzeichnet sind und von "Übersetzer A" übersetzt wurden.
en_uk: This way, for example, all segments that are tagged "Must be revised" and were translated by "Translator A", can be selected with a few clicks and then edited.

source: Oder es lassen sich alle Segmente selektieren, die in der Ausgangssprache das Wort "IT" enthalten und in der Zielsprache das Wort "Datenverarbeitung".
en_uk: Or all segments can be selected, which contain the word "IT" in the source language and the word "data processing" in the target language.

source: Sortierung
en_uk: Sorting

source: Die Segmentübersicht lässt sich zusätzlich nach jeder Spalte auf- oder absteigend sortieren - unabhängig davon, ob bereits ein Filter gesetzt ist oder nicht.
en_uk: Additionally, the segment overview can be sorted in an ascending or descending order after each column - regardless of whether a filter is set or not.

source: So lassen sich z. B. zunächst alle Segmente mit Matchraten zwischen 90 und 99 Prozent lektorieren, die "Status 1" haben und danach diejenigen mit "Status 2".
en_uk: This way, for example, all segments with match rates between 90 and 99 percent with "status 1" can be initially edited and then all those with "status 2".

source: Ein Klick auf eine Datei führt in der Segmenttabelle zum ersten Segment dieser Datei.
en_uk: By clicking on a file, you get to the first segment of this file in the segment table.

source: Qualitätssicherung ist der Zweck des Lektorats einer Übersetzung und damit der Zweck von translate5.
en_uk: Quality assurance is the purpose of editing a translation and consequently the purpose of translate5.

source: Daher stellt translate5 über das eigentliche Lektorat hinaus für die Qualitätssicherung eine ganze Reihe von interessanten und teilweise einzigartigen Features bereit:
en_uk: Therefore, translate5 provides quite a number of interesting and in part unique features for quality assurance exceeding the actual editing.

source: Mit translate5 können beliebigen Teilbereichen von Segmenten QM-Tags zugewiesen werden.
en_uk: With translate5, QM tags can be allocated to any section of segments.

source: Werte können beispielsweise sein:
en_uk: Values can be, for example:

source: Sie ist in grafisch gut aufbereiteter Form innerhalb des Editors abrufbar oder alternativ als XML-Download.
en_uk: It can be accessed within the Editor in graphically well presented form or alternatively as an XML download.

source: QM-Tags können auch in der Ausgangssprache eingefügt und entsprechend getrennt ausgewertet werden.
en_uk: QM tags can also be inserted into the source language and separately evaluated accordingly.

source: Ob dies möglich ist oder nicht ist bei der Projektanlage einstellbar.
en_uk: Whether this is possible or not can be set when creating the project.

source: Mit Hilfe von QTLaunchpad (siehe unten) kann auf Basis dieser Statistik ein Prozentwert errechnet werden, der die Übersetzungsqualität objektiv beschreibt.
en_uk: With the help of the QTLaunchpad (see below), a percentage value describing the translation quality objectively, can be calculated based on this statistics.

source: Die QM-Erfassung auf Subsegment-Basis wurde inspiriert durch und umgesetzt für QTLaunchpad.
en_uk: QM acquisition on subsegment basis was inspired and implemented for QTLaunchpad.

source: Vor QTLaunchpad gab es hierzu keinen Ansatz, der eine verlässliche Vergleichbarkeit herstellt.
en_uk: BeforeQTLaunchpad , no approach for reliable comparability existed.

source: QTLaunchpad ist ein EU-gefördertes Projekt von DFKI (Deutsches Forschungsinstitut für künstliche Intelligenz), Dublin City University, University of Sheffield und Athena Institute for Language and Speech Processing. translate5 stellt daher eine ideale Umgebung dar, um mit den Kriterien von QTLaunchpad Übersetzungsqualität zu messen.
en_uk: QTLaunchpad is a project supported by the EU by DFKI (Deutsches Forschungsinstitut für künstliche Intelligenz), Dublin City University, University of Sheffield and Athena Institute for Language and Speech Processing. Therefore, translate5 presents an ideal setting for measuring translation quality with the criteria of QTLaunchpad .

source: Zusätzlich kann jedem Segment ein Statuswert zugeordnet werden.
en_uk: Additionally, a status value can be assigned to each segment.

source: translate5 wird beim Import eine TBX-Datei übergeben.
en_uk: A TBX file is turned over to translate5 during import.

source: XliffTermTagger unterstützt zur Termerkennung neben exakten Treffern auch Stemming, Fuzzy-Matching und Groß-Kleinschreibungstoleranz.
en_uk: Aside from exact hits, XliffTermTagger also supports stemming, fuzzy matching, and tolerance in the use of upper and lower case letters.

source: Die für die QM-Tags auswählbaren Werte können zu Projektbeginn flexibel festgelegt werden.
en_uk: The values selectable for the QM tags can be flexibly specified at the start of the project.

source: Welche dieser Verfahren und welcher Fuzzy-Wert verwendet werden, wird in translate5 festgelegt.
en_uk: It is specified in translate5, which of these procedures and which fuzzy value is used.

source: Die Segment-Metadaten zeigen alle Terme an, die zum selben Begriff gehören wie der Term im Segment - auch wenn sie nicht im Segment selbst vorkommen.
en_uk: The segment meta data show all terms belonging to the same term as the term in the segment - even if they themselves do not come up in the segment.

source: Die Begriffsdefinition wird bei jedem Term sichtbar, sobald die Maus über ihn gezogen wird ‒ bei ausgangssprachlichen Termen die ausgangssprachliche Definition und bei zielsprachlichen Termen die zielsprachliche Definition.
en_uk: The term definition is visible at each term as soon as the mouse is dragged over it - with source-language terms the source-language definition and with target-language terms the target-language definition.

source: translate5 geht einen Schritt weiter, als die meisten kostenpflichtigen Lösungen:
en_uk: translate5 goes one step further than most of the solutions subject to charge:

source: Beim Export eines Projekts aus translate5 können auf Wunsch Änderungsauszeichnungen eingefügt werden.
en_uk: When exporting a project from translate5, it is optional to insert modification tags.

source: Wird ein so exportiertes Dokument in Trados Studio geöffnet, sind die durch den Lektor in translate5 durchgeführten Änderungen Teil der Änderungshistorie innerhalb von Trados Studio und können mit der Funktion "Änderungen nachverfolgen" innerhalb von Trados Studio angenommen oder abgelehnt werden.
en_uk: If a document exported in such a way, is opened in Trados Studio, the changes performed by the editor in translate5, are part of the modification history within Trados Studio and can be accepted or rejected with the function "Monitor changes" within Trados Studio.

source: Kommentare werden innerhalb der Tabellenstruktur von translate5 in einer eigenen Spalte erfasst.
en_uk: translate5 captures comments in a column of its own within the table structure.

source: Wie alle anderen Spalten auch können die Segmente eines Projekts in translate5 auf Basis der Kommentarspalte gefiltert und sortiert werden.
en_uk: As all other columns, too, the segments of a project can be filtered or sorted in translate5 on the basis of the comment column.

source: So können z. B. alle Segmente die Kommentare enthalten zu oberst angezeigt werden - oder nur alle Segmente angezeigt werden, die Kommentare eines bestimmten Nutzers enthalten.
en_uk: For example, all segments with comments can be displayed on top - or only those segments with comments of a specific user can be displayed.

source: Bei jedem Kommentar ist zu sehen, welcher Nutzer den Kommentar wann erstellt hat.
en_uk: Each comment shows, which user created the comment when.

source: Eigene Kommentare können jederzeit bearbeitet oder gelöscht werden.
en_uk: Your own comments can be edited or deleted at any time.

source: QM- und Statuserfassung auf Segmentebene
en_uk: QM and Status Detection on Segment Basis

source: Sperren von 100%-Matches
en_uk: Blocking of 100% Matches
